app/controllers/tasks_controller.rb

  def index
    if params[:hidden]
      @tasks = Task.where(user_id: @logged_in_user, complete: false).order(due_by: :asc)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 2 AND "tasks"."complete" = ? ORDER BY "tasks"."due_by" ASC  [["complete", "f"]]

    task = Task.new(task_params)
    task.complete = false
    if task.save
---
INSERT INTO "tasks" ("user_id", "content", "due_by", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["content", "best task EVER!"], ["due_by", "2017-07-28 00:00:00"], ["created_at", "2017-07-17 19:25:10.599170"], ["updated_at", "2017-07-17 19:25:10.599170"]]

    task = Task.find_by_id(params[:id])
    task.complete ? task.complete = false : task.complete = true
    if task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["complete", "t"], ["updated_at", "2017-07-17 19:51:12.782803"], ["id", 1]]